/**
 * @file titles.h
 * @author VAlex28 (anan20000228@gmail.com)
 * @brief 
 * 
 */

#ifndef __TITLES_H__
#define __TITLES_H__

#include "alarms.h"

#define FIRST_RR_TITLES     10000
#define COUNT_RR_ONE_TITLE  25

typedef struct Title_s
{
  Alarm_t number;
  const char * name;
} Title_t;

void finitTitle(void);

const Title_t arrTitles[] = {
  {alPowerOn1,               "Включение панели К1"},
  {alPowerOn2,               "Включение панели К2"},
  {alPowerOn3,               "Включение панели К-Т1/3"},
  {alPowerOn4,               "Включение панели К-Т1/4"},
  {alOpenUserAccess1,        "Доступ пользователя панели К1 открыт"},
  {alOpenUserAccess2,        "Доступ пользователя панели К2 открыт"},
  {alOpenUserAccess3,        "Доступ пользователя панели К-Т1/3 открыт"},
  {alOpenUserAccess4,        "Доступ пользователя панели К-Т1/4 открыт"},
  {alOpenAdminAccess1,       "Доступ администратора панели К1 открыт"},
  {alOpenAdminAccess2,       "Доступ администратора панели К2 открыт"},
  {alOpenAdminAccess3,       "Доступ администратора панели К-Т1/3 открыт"},
  {alOpenAdminAccess4,       "Доступ администратора панели К-Т1/4 открыт"},

  {alConFailPanel1,         "Обрыв связи с панелью К1"},
  {alConFailPanel2,         "Обрыв связи с панелью К2"},
  {alConFailPanel3,         "Обрыв связи с панелью К-Т1/3"},
  {alConFailPanel4,         "Обрыв связи с панелью К-Т2/4"},
  {alConFailDP1,            "Обрыв связи с контроллером К-1"},
  {alConFailDP2,            "Обрыв связи с контроллером К-2"},
  {alConFailDP3,            "Обрыв связи с контроллером К-Т1"},
  {alConFailDP4,            "Обрыв связи с контроллером К-Т3"},
  {alConFailDP5,            "Обрыв связи с контроллером К-Т2"},
  {alConFailDP6,            "Обрыв связи с контроллером К-Т4"},
  {alConFailGate,           "Обрыв связи со Шлюзом 485-RTU-LAN"},
  {alConFailShot,                "Обрыв связи с ШОТ"},
  {alConFailShsn,                "Обрыв связи с ШСН"},
  {alConFailShsnD,               "Обрыв связи с ШСН-Д"},

//---
  
  {alConRestoredPanel1,         "Связь с панелью К1 восстановлена"},
  {alConRestoredPanel2,         "Связь с панелью К2 восстановлена"},
  {alConRestoredPanel3,         "Связь с панелью К-Т1/3 восстановлена"},
  {alConRestoredPanel4,         "Связь с панелью К-Т2/4 восстановлена"},
  {alConRestoredDP1,            "Связь с контроллером К-1 восстановлена"},
  {alConRestoredDP2,            "Связь с контроллером К-2 восстановлена"},
  {alConRestoredDP3,            "Связь с контроллером К-Т1 восстановлена"},
  {alConRestoredDP4,            "Связь с контроллером К-Т3 восстановлена"},
  {alConRestoredDP5,            "Связь с контроллером К-Т2 восстановлена"},
  {alConRestoredDP6,            "Связь с контроллером К-Т4 восстановлена"},
  {alConRestoredGate,           "Связь со Шлюзом 485-RTU-LAN восстановлена"},
  {alConRestoredShot,            "Связь со ШОТ восстановлена"},
  {alConRestoredShsn,            "Связь со ШСН восстановлена"},
  {alConRestoredShsnD,           "Связь со ШСН-Д восстановлена"},

//-------------------------------------------------------------------------------------
//--------------------------  SHOT  ---------------------------------------------------
//-------------------------------------------------------------------------------------
  {alShotCon_1,                 "Включение панели"},
  {alShotCon_2,                 "Открытие доступа администратора"},
  {alShotCon_3,                 "Открытие доступа пользователя"},
//-------------------------------------------------------------------------------------
  {alShotCon_4,                 "Обрыв связи с ЗВУ1 (ESI)"},
  {alShotCon_5,                 "Обрыв связи с ЗВУ2 (ESI)"},
  {alShotCon_6,                 "Обрыв связи с Аналог.платой 1"},
  {alShotCon_7,                 "Обрыв связи с Дискрет.платой 1"},
  {alShotCon_8,                 "Обрыв связи с БКИ(ф) 1"},
  {alShotCon_9,                 "Обрыв связи с Датчиком темп. 1"},
//-------------------------------------------------------------------------------------
  {alShotCon_10,                "Связь с ЗВУ1 восстановлена (ESI)"},
  {alShotCon_11,                "Связь с ЗВУ2 восстановлена (ESI)"},
  {alShotCon_12,                "Связь с Аналог.платой 1 восстановлена"},
  {alShotCon_13,                "Связь с Дискрет.платой 1 восстановлена"},
  {alShotCon_14,                "Связь с БКИ(ф) 1 восстановлена"},
  {alShotCon_15,                "Связь с Датчиком темп. 1 восстановлена"},
//-------------------------------------------------------------------------------------
  {alShotB118_1,                "Неисправность ЗВУ1 (ESI)"},
  {alShotB118_2,                "Неисправность ЗВУ2 (ESI)"},
//-------------------------------------------------------------------------------------
//выходы
  {alShotAnP_1,                 "Напряжение на шинах ±ESI U>235B, U<209B"},
  {alShotAnP_2,                 "Неисправность ЗВУ1 (UZ1)"},
  {alShotAnP_3,                 "Неисправность ЗВУ2 (UZ2)"},
  {alShotAnP_4,                 "Q3"},
  {alShotAnP_5,                 "Напряжение на шинах ±ESI U>245B, U<198B"},
  {alShotAnP_6,                 "Q5"},
  {alShotAnP_7,                 "Система управления не в норме"},
  {alShotAnP_8,                 "Q7"},
//входы
  {alShotAnP_9,                 "\"Земля\" в сети постоянного тока Rиз < 20 кОм"},
  {alShotAnP_10,                "Предварительная авария: Глубокий разряд АБ"},
  {alShotAnP_11,                "Аварийное откл. выключателя дополнительных цепей"},
  {alShotAnP_12,                "Аварийное откл. выключателя линии"},
  {alShotAnP_13,                "Аварийное откл. выключателя на выходе ЗВУ1(ЗВУ2)"},
  {alShotAnP_14,                "Отсутствует связь с АБ"},
  {alShotAnP_15,                "Отсутствие напряжения на вводе"},
  {alShotAnP_16,                "I7"},
//-------------------------------------------------------------------------------------
  {alShotDP_1,                  "I1"},
  {alShotDP_2,                  "I2"},
  {alShotDP_3,                  "I3"},
  {alShotDP_4,                  "I4"},
  {alShotDP_5,                  "I5"},
  {alShotDP_6,                  "I6"},
  {alShotDP_7,                  "Неисправность БКЦА-М"},
  {alShotDP_8,                  "Аварийное выключение выключателя на вводе 2 ~380В"},
  {alShotDP_9,                  "Аварийное выключение выключателя на вводе 1 ~380В"},
  {alShotDP_10,                 "Аварийное выключение выключателя на вводе АБ"},
  {alShotDP_11,                 "I11"},
  {alShotDP_12,                 "I12"},
  {alShotDP_13,                 "I13"},
  {alShotDP_14,                 "I14"},
  {alShotDP_15,                 "I15"},
  {alShotDP_16,                 "I16"},
  {alShotDP_17,                 "I17"},
  {alShotDP_18,                 "I18"},
  {alShotDP_19,                 "I19"},
  {alShotDP_20,                 "I20"},
  {alShotDP_21,                 "1QF1 «Rиз < 20 кОм»"},
  {alShotDP_22,                 "1QF2 «Rиз < 20 кОм»"},
  {alShotDP_23,                 "1QF3 «Rиз < 20 кОм»"},
  {alShotDP_24,                  "1QF4 «Rиз < 20 кОм»"},
  {alShotDP_25,                 "1QF5 «Rиз < 20 кОм»"},
  {alShotDP_26,                 "1QF6 «Rиз < 20 кОм»"},
  {alShotDP_27,                 "1QF7 «Rиз < 20 кОм»"},
  {alShotDP_28,                 "1QF8 «Rиз < 20 кОм»"},
  {alShotDP_29,                 "1QF9 «Rиз < 20 кОм»"},
  {alShotDP_30,                 "1QF10 «Rиз < 20 кОм»"},
  {alShotDP_31,                 "1QF11 «Rиз < 20 кОм»"},
  {alShotDP_32,                 "1QF12 «Rиз < 20 кОм»"},
  {alShotDP_33,                 "1QF13 «Rиз < 20 кОм»"},
  {alShotDP_34,                 "1QF14 «Rиз < 20 кОм»"},
  {alShotDP_35,                 "Q15"},
  {alShotDP_36,                 "Q16"},
  {alShotDP_37,                 "Q17"},
  {alShotDP_38,                 "Q18"},
  {alShotDP_39,                 "Q19"},
  {alShotDP_40,                 "Q20"},
//-------------------------------------------------------------------------------------
  {alShotBKIf_1,                 "1QF1 «Rиз < 40 кОм»"},
  {alShotBKIf_2,                 "1QF2 «Rиз < 40 кОм»"},
  {alShotBKIf_3,                 "1QF3 «Rиз < 40 кОм»"},
  {alShotBKIf_4,                 "1QF4 «Rиз < 40 кОм»"},
  {alShotBKIf_5,                 "1QF5 «Rиз < 40 кОм»"},
  {alShotBKIf_6,                 "1QF6 «Rиз < 40 кОм»"},
  {alShotBKIf_7,                 "1QF7 «Rиз < 40 кОм»"},
  {alShotBKIf_8,                 "1QF8 «Rиз < 40 кОм»"},
  {alShotBKIf_9,                 "1QF9 «Rиз < 40 кОм»"},
  {alShotBKIf_10,                "1QF10 «Rиз < 40 кОм»"},
  {alShotBKIf_11,                "1QF11 «Rиз < 40 кОм»"},
  {alShotBKIf_12,                "1QF12 «Rиз < 40 кОм»"},
  {alShotBKIf_13,                "1QF13 «Rиз < 40 кОм»"},
  {alShotBKIf_14,                "1QF14 «Rиз < 40 кОм»"},
//-------------------------------------------------------------------------------------
//--------------------------  SHSN  ---------------------------------------------------
//-------------------------------------------------------------------------------------
  {alShsnCon_1,                  "Включение панели"},
  {alShsnCon_2,                  "Открытие доступа администратора"},
  {alShsnCon_3,                  "Открытие доступа пользователя"},
//-------------------------------------------------------------------------------------
  {alShsnCon_4,                  "Обрыв связи с Дискрет.платой 1"},
  {alShsnCon_5,                  "Связь с Дискрет.платой 1 восстановлена"},
  {alShsn_1,                     "Ввод 1 аварийно отключен"},
  {alShsn_2,                     "Ввод 2 аварийно отключен"},
  {alShsn_3,                     "Ввод 1 ~220В аварийно отключен"},
  {alShsn_4,                     "Ввод 1 ~36В аварийно отключен"},
  {alShsn_5,                     "Ввод 2 ~220В аварийно отключен"},
  {alShsn_6,                     "Ввод 2 ~36В аварийно отключен"},
  {alShsn_7,                     "Ввод 1. Питание ШОС аварийно отключено"},
  {alShsn_8,                     "Ввод 2. Питание ШОС аварийно отключено"},
  {alShsn_9,                     "I9"},
  {alShsn_10,                    "I10"},
  {alShsn_11,                    "Ввод 1 ~220В в работе"},
  {alShsn_12,                    "Ввод 2 ~220В в работе"},
  {alShsn_13,                    "Ввод 1 ~36В в работе"},
  {alShsn_14,                    "Ввод 2 ~36В в работе"},
  {alShsn_15,                    "Ввод 1 ~220В нет напряжения"},
  {alShsn_16,                    "Ввод 2 ~220В нет напряжения"},
  {alShsn_17,                    "Ввод 1 ~36В нет напряжения"},
  {alShsn_18,                    "Ввод 2 ~36В нет напряжения"},
  {alShsn_19,                    "Аварийное отключение выключателя секции ~220В"},
  {alShsn_20,                    "Аварийное отключение выключателя секции ~36В"},
//-------------------------------------------------------------------------------------
//--------------------------  SHSN-D  -------------------------------------------------
//-------------------------------------------------------------------------------------
  {alShsnDCon_1,                 "Включение панели"},
  {alShsnDCon_2,                 "Открытие доступа администратора"},
  {alShsnDCon_3,                 "Открытие доступа пользователя"},
//-------------------------------------------------------------------------------------
  {alShsnDCon_4,                 "Обрыв связи с Дискрет.платой 1"},
  {alShsnDCon_5,                 "Связь с Дискрет.платой 1 восстановлена"},
  {alShsnD_1,                    "Ввод 1 аварийно отключен"},
  {alShsnD_2,                    "Ввод 2 аварийно отключен"},
  {alShsnD_3,                    "Ввод 1 ~220В аварийно отключен"},
  {alShsnD_4,                    "Ввод 1 ~36В аварийно отключен"},
  {alShsnD_5,                    "Ввод 2 ~220В аварийно отключен"},
  {alShsnD_6,                    "Ввод 2 ~36В аварийно отключен"},
  {alShsnD_7,                    "Ввод 1. Питание ШОС аварийно отключено"},
  {alShsnD_8,                    "Ввод 2. Питание ШОС аварийно отключено"},
  {alShsnD_9,                    "I9"},
  {alShsnD_10,                   "I10"},
  {alShsnD_11,                   "Ввод 1 ~220В в работе"},
  {alShsnD_12,                   "Ввод 2 ~220В в работе"},
  {alShsnD_13,                   "Ввод 1 ~36В в работе"},
  {alShsnD_14,                   "Ввод 2 ~36В в работе"},
  {alShsnD_15,                   "Ввод 1 ~220В нет напряжения"},
  {alShsnD_16,                   "Ввод 2 ~220В нет напряжения"},
  {alShsnD_17,                   "Ввод 1 ~36В нет напряжения"},
  {alShsnD_18,                   "Ввод 2 ~36В нет напряжения"},
  {alShsnD_19,                   "Аварийное отключение выключателя секции ~220В"},
  {alShsnD_20,                   "Аварийное отключение выключателя секции ~36В"},

  {alConFailAtAllPanel,          "Панель не в сети"},
  {alConFailHighLevel,           "Нет связи с верхним уровнем"},

  {alTransTemperProtectT1,       "Тепловая защита трансформатора Т1"}, 
  {alTransTemperProtectT2,       "Тепловая защита трансформатора Т2"}, 
  {alTransTemperProtectT3,       "Тепловая защита трансформатора Т3"}, 
  {alTransTemperProtectT4,       "Тепловая защита трансформатора Т4"}, 
  {alFailOpticalSwitchKO14,      "Неисправность коммутатора оптического КО14"}, 
  {alFailOpticalSwitchKO15,      "Неисправность коммутатора оптического КО15"}, 
  {alFailOpticalSwitchKO2,       "Неисправность коммутатора оптического КО2"}, 
  {alFailOpticalSwitchKO1,       "Неисправность коммутатора оптического КО1"}, 

  {alShortEn,                    "Авария ШОТ"},
  {alShsnEn,                     "Авария ШСН"},
  {alShSnDEn,                    "Авария ШСН-Д"},

  {alNone}
};

#endif // __TITLES_H__